# 1)რითი ვხვდებით რომ ფუნქცია ფუნქციაა ?

# ა) როცა ფუნქციას გვერძე უწერია ფრშხილი.
# ბ)როცა ფუნქცია  მინიმუმ 10 სიმბოლოსგან შედგება.
# გ)როცა ფუნქციას გვერძე ბრჭყალები უწერია.
# დ)როცა ფუნქციას დასაწყისში უწერია # 




#2)როდესაც კოდით სახლის სქემას ვაგებთ რა ბრძანებას ვწერთ პირველ რიგში?

# ა) forward()
# ბ) left()
# გ) from turtle import *
# დ)  right()




# 3) ამ კოდს აკლია ერთერთ ხაზზე რაღაცა დაამატე რომ სწორი გამოვიდეს და error-ი არ დააბრუნოს
# while i < 20:
#     i +=1
#     print(i)
 
# 4) რა შედეგს გამოიტანტ ტერმინალში?

# name = "nika jajanidze"

# ammount_of_a = name.count("a")

# print(ammount_of_a)

# ა) 4
# ბ) 3
# გ) 5
# დ) 2



# 5) რა შედეგს გამოიტანტ ტერმინალში?

# name = "nika jajanidze"

# ammount_of_i = name.count("i")

# print(ammount_of_i)



# ა) 4
# ბ) 3
# გ) 5
# დ) 2

# 6) რამდენჟერ დაიპრინტება შედეგი ტერმინალში?

# print("hello friend")
print("პროგრამირება კაია")
# print ("გამარჯობა")
print("წარმატებები")

# ა)4
# ბ)2
# გ)3
# დ)1

# 7) რა შედეგს გამოიტანს ტერმინალში?

# x = 8

# print(type(x))

# y = "8"

# print(type(y))

# ა) int და str
# ბ) int და float
# გ) str და float
# დ) int და int


# 8) რა შედეგს გამოიტანს ტერმინალში?

# a = "nika 14 jajanidze"
# print(len(a))


# ა)17
# ბ)15
# გ)14
# დ)16




# 9) რა შედეგს გამოიტანს ტერმინალში?

# a = "nika 14 jajanidze"
# print(a[5] + a[8])


# ა)1j
# ბ)14
# გ)4n
# დ) j



# 10) რამდენჯერ იმუშავებს ეს კოდი ?

for i in range(1,18,2):
    print(i)